{
  "documentTitle": "Top 25 Current Affairs of 2025",
  "items": [
    {
      "Title": "1. Digital Access as a Fundamental Right (Amar Jain vs. UoI)",
      "Summary": "The SC declared digital access as a part of Article 21, specifically for the disabled.",
      "Text": "Mandates ''Universal Design'' in apps (e.g., CAPTCHA alternatives for the blind); ensures equality in the digital-first economy.\\nWay Forward: Formulation of ''National Digital Accessibility Standards''\\nPrelims Fact: Article 15 prohibits discrimination on grounds of disability as interpreted in this judgment.\\n"
    },
    {
      "Title": "2. 15th Vice President of India (Shri C.P. Radhakrishnan)",
      "Summary": "VP election held in August 2025 following the resignation of the previous Vice President, Shri Jagdeep Dhankar.",
      "Text": "The election process is defined under Articles 63 to 71 of the Constitution.\\nElectoral College: Unlike the Presidential election, the VP is elected by an electoral college consisting of all members of both Houses of Parliament (Lok Sabha and Rajya Sabha). Note that this includes the nominated members in both houses.\\nSystem of Election: Proportional representation by means of a Single Transferable Vote (STV) and a secret ballot.\\nResignation (Article 67a): The Vice President may resign by submitting the resignation “under his hand” (i.e., personally signed) to the President of India. The resignation is effective immediately after it is accepted by the President.\\nAcceptance: The resignation becomes effective the moment it is accepted by the President. One key difference: If the President resigns by writing to the Vice President, the Vice President is required to communicate this to the Speaker of the House of People immediately. There is no such requirement if the VP resigns.\\nFilling the vacancy (Article 68): The Constitution does not provide for an ''Acting Vice President.'' If the office falls vacant due to resignation, it remains vacant until a new VP is elected.\\nElection Timeline: Article 68(2) states that an election to fill a vacancy caused by resignation must be held ''as soon as possible.'' (Note: For the President, this is strictly within 6 months; for the VP, the phrasing is more ambiguous).\\nAs there is no interim or acting VP till the role is filled with a new election, the Deputy Chairman of the Rajya Sabha performs the functions of the Chairman till such time the new VP is elected.\\nRemoval: The VP cannot be ''impeached'' (a term reserved strictly for the President under Article 61). Instead, the removal process is outlined in Article 67(b):\\nInitiation: The resolution for removal can only be introduced in the Rajya Sabha.\\nEffective Majority: It must be passed by the Rajya Sabha by a majority of all the then members (Total strength minus vacancies).\\nAgreement by Lok Sabha: Once passed by the RS, it must be agreed to by the Lok Sabha (Simple Majority).\\nNotice Period: A mandatory 14 days' notice must be given to the VP before moving the resolution.\\nGrounds for Removal: The Constitution does not specify any grounds for the removal of the Vice President.\\n"
    },
    {
      "Title": "3. Gender Equality in Armed Forces (Army JAG Ruling)",
      "Summary": "SC struck down the gender cap (6 out of 9 seats for men) in the Judge Advocate General branch. Replaces ''protective discrimination'' with meritocracy; aligns with the Babita Puniya case (2020).",
      "Text": "Way Forward: Developing a ''Common Merit List'' for all non-combat technical branches.\\nPrelims Fact: Section 12 of the Army Act, 1950, originally restricted women's entry.\\n"
    },
    {
      "Title": "4. Mission Karmayogi 2.0",
      "Summary": "Context: Transition from ''Rule-based'' to ''Role-based'' learning for 4.6 million civil servants.",
      "Text": "Pros: Uses the iGOT-Karmayogi platform for continuous upskilling, including in areas such as AI and Data Analytics.\\nWay Forward: Linking annual appraisals (PARs) directly to iGOT course completion.\\nPrelims Fact: Managed by the Capacity Building Commission (CBC).\\n"
    },
    {
      "Title": "5. Tribunal Reforms & Judicial Independence",
      "Summary": "Context: SC struck down rules allowing executive dominance in the appointment of tribunal members.",
      "Text": "Pros: Restores the ''Separation of Powers'' (Article 50); ensures specialists are not puppets of the ministry.\\nCons: Frequent litigation slows down the operationalization of new tribunals.\\nWay Forward: Establishing a National Tribunals Commission (NMC) as an independent umbrella body.\\nPrelims Fact: Chandra Kumar Case (1997) established that Tribunals are subject to the writ jurisdiction of High Courts."
    },
    {
      "Title": "6. India as the 4th Largest Economy",
      "Summary": "Context: India overtook Japan in nominal GDP ($4.18 trillion) in 2025.",
      "Text": "This means increased weightage in IMF/World Bank; attracts higher FDI via ''China Plus One'' strategy.\\nCons: Low per capita GDP ($2,880 vs Japan's $33,000) indicates high inequality.\\nWay Forward: Focus on ''Middle-Income Trap'' prevention via R&D investment.\\nPrelims Fact: GDP is calculated at Constant Prices (called Real GDP) and Current Prices (Nominal GDP).\\n"
    },
    {
      "Title": "7. Union Budget 2025: Purvodaya Scheme",
      "Summary": "Context: A dedicated plan for the accelerated development of Eastern India (Bihar, Jharkhand, Odisha, WB).",
      "Text": "Pros: Focuses on an ''Industrial Corridor'' to bridge regional disparity.\\nWay Forward: Integrated planning with PM Gati Shakti.\\nPrelims Fact: Eastern India holds 60% of India’s mineral reserves but lags in per-capita income.\\n"
    },
    {
      "Title": "8. PM Gati Shakti District-Level Rollout",
      "Summary": "Context: Operationalizing GIS-based Master Plans at the district level by 2025.",
      "Text": "Pros: Breaks silos between departments (Water, Power, Roads) during local project execution.\\nCons: Digital divide at the Panchayat level hinders data entry.\\nWay Forward: Capacity building for district collectors under Mission Karmayogi.\\nPrelims Fact: National Master Plan includes 16 Ministries and use of BISAG-N satellite imagery.\\n"
    },
    {
      "Title": "9. Raisin Research Centre, Sangli",
      "Summary": "Context: India’s first dedicated raisin research facility established in Maharashtra.",
      "Text": "Pros: Improves ''Value Addition'' in the grape value chain; helps in competing with Chinese/Turkish exports.\\nCons: High initial investment in cold storage for farmers.\\nWay Forward: Obtaining a GI tag for ''Sangli Raisins'' to boost global brand equity.\\nPrelims Fact: Maharashtra accounts for over 80% of India's grape production.\\n"
    },
    {
      "Title": "10. Digital Rupee (CBDC) Expansion",
      "Summary": "Context: RBI moved CBDC-Retail from ''pilot'' to ''full-scale'' implementation in 2025.",
      "Text": "Pros: Reduces the cost of physical cash management ($4,000+ crores annually); enables ''Programmable Payments'' (e.g., subsidies).\\nCons: Concerns regarding user privacy and transaction anonymity.\\nWay Forward: Legislation to define the legal tender status of digital currency.\\nPrelims Fact: CBDC is a direct liability of the Central Bank, unlike UPI which is a payment bridge.\\n"
    },
    {
      "Title": "11. The ''Mittelstand'' Model (Economic Survey 2024-25)",
      "Summary": "Context: The Economic Survey 2024-25 proposed adopting the German ''Mittelstand'' model for India’s SME (Small and Medium Enterprises) sector.",
      "Text": "Pros: Encourages SMEs to stay small but ''Hidden Champions'' in niche global markets; focuses on high-quality engineering and vocational training.\\nThe name is rooted in German history and language:\\nEtymology: It is a compound of ''Mittel'' (middle) and ''Stand'' (class, estate, or standing). Historical Context: In the medieval ''estate system,'' society was divided into three levels: the aristocracy (top), the peasantry (bottom), and the Mittelstand—the free bourgeoisie, craftsmen, and merchants of the cities who occupied the middle ground.\\nEconomic Context: Today, it refers to the ''middle layer'' of companies that sit between micro-enterprises/startups and giant multinational corporations (like Siemens or Volkswagen). It represents a ''middle-class'' business ethos characterized by stability and independence.\\nWay Forward: Providing ''Special Credit Lines'' and R&D support specifically for niche manufacturing exports.\\nPrelims Fact: Mittelstand firms are often family-owned and account for over 50% of Germany’s GDP."
    },
    {
      "Title": "12. SpaDeX Mission (ISRO)",
      "Summary": "Context: Space Docking Experiment successfully joined two satellites in orbit.",
      "Text": "Pros: Critical for the Bharatiya Antariksh Station (BAS) and moon sample return missions.\\nPrelims Fact: Uses a ''Chaser'' and ''Target'' satellite configuration.\\n"
    },
    {
      "Title": "13. COP30: Belém Mutirão Package",
      "Summary": "Context: Held in Brazil; focused on the ''Belém Mutirão'' for tripling adaptation finance.",
      "Text": "Operationalized the Loss and Damage Fund with $1.2 billion pledged. However, disagreements on Article 6 (Carbon Markets) persisted.\\nWay Forward: Bridging the $366 billion annual ''Adaptation Gap'' for developing nations.\\nPrelims Fact: Brazil is the first country to host a COP in the Amazon biome.\\n"
    },
    {
      "Title": "14. National Quantum Mission (NQM) Milestones",
      "Summary": "Context: India deployed its first 500km Quantum Key Distribution (QKD) network in 2025.",
      "Text": "Pros: Provides ''Post-Quantum Cryptography'' (PQC) for defense and banking.\\nCons: Shortage of skilled quantum physicists in the domestic market.\\nWay Forward: Setting up 4 Thematic Hubs (T-Hubs) in IITs.\\nPrelims Fact: Quantum bits (Qubits) use properties of ''Superposition'' and ''Entanglement.''\\n"
    },
    {
      "Title": "15. Carbon Capture & Utilisation (CCU) Testbeds",
      "Summary": "Context: DST launched 5 testbeds in the cement sector (e.g., IIT Bombay + Dalmia Cement).",
      "Text": "Pros: Decarbonizes ''hard-to-abate'' sectors; converts CO2 into concrete blocks or olefins.\\nCons: High energy consumption of the capture process itself.\\nWay Forward: Incentivizing CCU under the Carbon Credit Trading Scheme (CCTS).\\nPrelims Fact: Cement production accounts for ~7% of global CO2 emissions.\\n"
    },
    {
      "Title": "16. Green Hydrogen Hubs (Major Ports)",
      "Summary": "Context: Deendayal (Gujarat), Paradip (Odisha), and V.O.C. (Tamil Nadu) ports designated as Hydrogen Hubs.",
      "Text": "Pros: Facilitates bulk export; integrates Renewable Energy (RE) with shipping.\\nCons: Electrolyzer costs remain high; storage challenges (Hydrogen embrittlement).\\nWay Forward: Achieving the target of 5 MMT production by 2030.\\nPrelims Fact: Green Hydrogen is produced via electrolysis of water using 100% RE.\\n"
    },
    {
      "Title": "17. Gaganyaan: Integrated Air-Drop Test (IADT-01)",
      "Summary": "Context: Successfully tested the parachute deceleration system using a Chinook helicopter.",
      "Text": "Pros: Validates astronaut safety during the re-entry and splashdown phase.\\nCons: Delay in the crewed mission (now Q1 2027) due to rigorous safety trials.\\nWay Forward: Launch of the Vyommitra (Humanoid) mission in late 2025.\\nPrelims Fact: The ''Drogue'' parachutes stabilize the capsule before the ''Main'' parachutes deploy.\\n"
    },
    {
      "Title": "18. Agentic AI & Global Governance",
      "Summary": "Context: Shift from LLMs to ''AI Agents'' that can execute tasks autonomously.",
      "Text": "Pros: Dramatic productivity gains in coding and research.\\nCons: Accountability gap—who is responsible if an AI Agent makes a legal error?\\nWay Forward: International treaty on AI ''Kill Switches'' and transparency logs.\\nPrelims Fact: GPAI (Global Partnership on AI) is chaired by India in 2024-25.\\n"
    },
    {
      "Title": "19. UNESCO City of Gastronomy: Kozhikode (Update)",
      "Summary": "Context: UNESCO's City of Gastronomy project is part of the wider Creative Cities Network. Founded in 2004, the “Creative Cities Network” is a flagship city programme of UNESCO to promote cooperation among cities which have recognized culture and creativity as strategic drivers of sustainable urban development.",
      "Text": "As of 2022, there are almost 300 cities from around 90 countries in the network.\\nKozhikode (Kerala) solidified its status as a UNESCO Creative City for its culinary heritage.\\nIn 2025, UNESCO created the “City of Architecture” designation, with the inaugural cities being Bistrita (Romania), Kashan (Iran), Lusail (Qatar), Quito (Ecuador), and Rovaniemi (Finland).\\nPrelims Fact: Gwalior (MP) was previously named UNESCO City of Music.\\n"
    },
    {
      "Title": "20. Amrit Dharohar – Ramsar Sites",
      "Summary": "Context: In 2025, India added the following sites to the Ramsar Convention on Wetlands of International Importance, bringing the total count of Ramsar sites in India to 96.",
      "Text": "Siliser Lake (Rajasthan): A man-made lake built in 1845 by Maharaja Vinay Singh, ruler of Alwar, by constructing an embankment on a tributary of the Ruparel River. Lies within the buffer zone of the Sariska Tiger Reserve, enhancing its eco-tourism and conservation value. Supports 149 bird species and 17 mammal species, including the Vulnerable river tern (Sterna aurantia) and 1% of the biogeographic population of black stork (Ciconia nigra).\\nKopra Jalashay (Chattisgarh): A man-made reservoir in Chhattisgarh, in the upper catchments of the River Mahanadi, near Bilaspur. Supports the vulnerable species: greater spotted eagle (Aquila clanga) and endangered species: Egyptian vulture (Neophron percnopterus).\\nUdaypur Lake (Bihar)\\nGokul Reservoir (Bihar)\\nKhichan Wetland (Rajasthan): Known for migratory demoiselle cranes locally known as Kurja.\\nMenar Wetland Complex (Rajasthan): Known for migratory Greater Flamingo and large population of Peacocks.\\nSakkarakottai Bird Sanctuary\t(Tamil Nadu)\\nTherthangal Bird Sanctuary (Tamil Nadu)\\nKhecheopalli Lake (Sikkim)\\nBackground: The Convention is named after the city of Ramsar in Iran, where it was signed in 1971. Every three years, representatives of the contracting parties meet as the Conference of the Contracting Parties (COP), the policy-making organ of the convention which adopts decisions such as site designations. In 2022, COP15 was held in Montreal, Canada.\\nRamsar Convention COP15 (2025): The 15th Meeting of the Conference of the Contracting Parties (COP15) to the Ramsar Convention on Wetlands was held in Victoria Falls, Zimbabwe, from July 23-31, 2025, under the theme ''Protecting Wetlands for Our Common Future,'' resulting in the adoption of the 5th Strategic Plan (2025-2034), 13 resolutions (including India's on sustainable lifestyles), and the Victoria Falls Declaration to boost wetland restoration and wise use globally.\\nAmrit Dharohar Scheme: launched in June 2023, focuses on promoting the sustainable use and conservation of wetlands across India. Recognizing the ecological, social, and economic importance of wetlands, this scheme aligns with India’s commitments under global frameworks such as the Ramsar Convention and the Sustainable Development Goals (SDGs)."
    },
    {
      "Title": "21. Operation Sindoor",
      "Summary": "Context: India’s 2025 strategic operation to neutralize terror infrastructure across the LoC.",
      "Text": "Pros: Demonstrated ''Zero Tolerance''; used non-kinetic measures like suspending the Indus Waters Treaty.\\nCons: Risk of escalation into full-scale conflict with a nuclear neighbor.\\nWay Forward: Moving from ''Reactive'' to ''Proactive'' deterrence.\\nPrelims Fact: The Indus Waters Treaty (1960) gives India full rights over the Eastern rivers (Ravi, Beas, Sutlej).\\n"
    },
    {
      "Title": "22. Strait of Hormuz Crisis 2025",
      "Summary": "Context: Iran-Israel tensions led to threats of closing the world’s busiest oil chokepoint.",
      "Text": "Pros: Accelerated India’s Strategic Petroleum Reserve (SPR) phase-II.\\nIndian Strategic Petroleum Reserve Limited (ISPRL), a Government of India Special Purpose Vehicle (SPV), has established Strategic Petroleum Reserves  facilities with total capacity of 5.33 Million Metric Tonnes (MMT) at 3 locations, namely (i) Vishakhapatnam, (ii) Mangaluru and (iii) Padur. As per the consumption pattern of 2019-20, the total capacity is estimated to provide for about 9.5 days of crude oil requirement.\\nIn addition, Oil Marketing Companies (OMCs) in the country have storage facilities for crude oil and petroleum products for 64.5 days, thus the current total national capacity for storage of crude oil and petroleum products currently is 74 days.\\nUnder Phase II of the SPR Programme, the Government has given ‘in principle’ approval in June 2018 for establishing two additional SPR facilities with total storage capacity of 6.5 MMT at two locations namely (i) Chandikhol in Odisha (4 MMT) and (ii) Padur in Karnataka (2.5 MMT). As per the consumption pattern of 2019-20, 6.5 MMT SPR capacity is estimated to provide for about additional 12 days of India’s crude oil requirement.\\nCons: Spiked global Brent Crude prices to over $100/barrel, impacting India's CAD.\\nPrelims Fact: Strait of Hormuz connects the Persian Gulf with the Gulf of Oman; 20% of world oil passes through it.\\n"
    },
    {
      "Title": "23. India-New Zealand FTA (2025)",
      "Summary": "Context: Negotiations concluded in 9 months; focuses on a $5 billion trade target.",
      "Text": "Pros: Market access for Indian textiles and pharma; $20 billion NZ investment in 15 years.\\nCons: Sensitivities in India’s dairy sector remain a sticking point.\\nWay Forward: Professional mobility visas (5,000 annually) for Indian IT workers.\\nPrelims Fact: New Zealand is part of the ''Five Eyes'' intelligence alliance.\\n"
    },
    {
      "Title": "24. Albania’s AI Minister (Diella)",
      "Summary": "Context: Albania appointed an AI entity as a Minister for Public Procurement.",
      "Text": "Pros: Removes human bias and corruption in government tenders.\\nCons: Ethical dilemma regarding ''Constitutional Oaths'' and legal liability.\\nWay Forward: Evaluating the ''Albanian Model'' for India’s GeM (Government e-Marketplace).\\nPrelims Fact: Albania is a NATO member and an EU candidate country.\\n"
    },
    {
      "Title": "25. Operation Kaveri 2.0 (Sudan)",
      "Summary": "Context: Second phase of evacuation of Indian citizens from war-torn Sudan in 2025.",
      "Text": "Pros: Reaffirms India as a ''First Responder'' in the Global South.\\nCons: High risk to IAF assets (C-130J) in conflict zones.\\nWay Forward: Strengthening the permanent ''Indian Ocean Maritime Rescue Coordination Centre.''\\nPrelims Fact: Port Sudan is a key maritime gateway on the Red Sea.\\n"
    }
  ]
}